
export interface Product {
  id: number;
  slug: string;
  name: string;
  crossprice: number;
  price: number;
  image: string[];
  description: string[];
}

export const products: Product[] = [
  {
    id: 1,
    slug: "combo-pack-attar-4pcs",
    name: "4 pcs Combo Pack - Attar",
    crossprice: 2000,
    price: 1400,
    image: ["/products/spray.jpg", "/products/spray.jpg", "/products/spray.jpg"],
    description: [
      "আমাদের এই কম্বোতে যে ৪ টি আতর থাকছে, সেগুলির বিবরণ আলাদা করে দেওয়া হলো;",
      "**🌸Ehsas Al Arabiya – Suratti (Made in Saudi Arabia)**",
      "একটি সফট সুইট আরবিয়ান ফ্লোরাল আতর। হালকা মিষ্টতা, নরম ফুলের ঘ্রাণ ও ক্লিন ফিনিশ—যা একদম এলিগ্যান্ট ও আরামদায়ক অনুভূতি দেয়। ডেইলি ইউজ, পারিবারিক অনুষ্ঠান ও সব বয়সের জন্য উপযোগী।",
      "**Scent Type:** Soft Sweet • Floral • Elegant",
      "**Suitable For:** Unisex | Daily & Daytime Use",

      "**🧴Musk Rijali – Euro Valley (Made in India)**",
      "একটি পরিষ্কার, ন্যাচারাল ও মাস্কি আতর। নরম, শান্ত ও পবিত্র অনুভূতি দেয়—ডেইলি ইউজ ও নামাজের পর ব্যবহারের জন্য আদর্শ।",
      "**Scent Type:** Clean • Musky • Pure",
      "**Suitable For:** Unisex | Daily & Prayer Use",

      "**🌊Cool Water – Al Haramain (Made in Dubai)**",
      "একটি ফ্রেশ, কুল ও অ্যাকোয়াটিক আতর। সমুদ্রের হাওয়া ও ক্লিন অ্যারোমেটিক নোটের অনুভূতি—ডেইলি ইউজ ও গরম আবহাওয়ার জন্য আদর্শ।",
      "**Scent Type:** Fresh • Aquatic • Cool",
      "**Suitable For:** Men | Daily, Summer, Winter (Day time)",

      "**🩸Vampier Blood – Euro Valley (Summary)**",
      "একটি ডার্ক, সুইট ও রহস্যময় আতর। গাঢ় ফলের মিষ্টতা ও মাস্কি বেস—নাইট ইউজ ও স্পেশাল মোমেন্টের জন্য উপযোগী।",
      "**Scent Type:** Dark · Sweet · Musky",
      "**Suitable For:** Unisex | Night & Special Use"
    ],
  },
  {
    id: 1,
    slug: "genuin-leather-combo-giftset",
    name: "100% Genuin Leather Combo Gift Set",
    crossprice: 1790,
    price: 1490,
    image: [
      "/products/leather/i.jpg", 
      "/products/leather/ii.jpg", 
      "/products/leather/iii.jpg",
      "/products/leather/iv.jpg"
    ],
    description: [
      "**আমাদের প্রোডাক্টসমূহ তৈরি করা হয়েছে ১০০% জেনুইন লেদার দিয়ে। প্রাকৃতিক টেক্সচার, নিখুঁত সেলাই ও পরিমিত নকশার সমন্বয়ে প্রতিটি পণ্যই দেয় আভিজাত্য ও দীর্ঘস্থায়িত্ব। সময় যত যাবে, লেদারের সৌন্দর্য তত আরও গভীর ও ব্যক্তিগত হয়ে উঠবে।**",
      "প্রিমিয়াম মান",
      "দীর্ঘস্থায়ী ব্যবহার",
      "দৈনন্দিন ও ফরমাল ব্যবহারে উপযোগী",
      "হাতে যত্নসহকারে ফিনিশ করা",
      "স্টাইল ও মানের নিখুঁত সমন্বয়।"
    ],
  },
];
